Repository: seanpm2001/mt-training-data
Catalog: ts/ts_pontoon.tmx
Source language: en_us
Languages: ts

source: The Common Voice Sentence Collector has collected { $sentenceCount } sentences in { $languageCount } languages!
ts: Muhlengeleti wa Swivulwa swa Rito leri Tolovelekeke u hlengeletile swivulwa swa { $sentenceCount } hi tindzimi ta { $languageCount }!

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
ts: Nhlayo ya tiawara to rhekhoda rito leti tiyisisiweke hi vatirhisi va 2 eka va 3 hi vhoti ya “Ina”. Leswi swi fungha nhluvuko ku ya eka pakani ya tiawara ta 10k ya phurojeke hinkwayo.

source: The count of voice recording hours we have collected so far.
ts: Nhlayo ya tiawara to rhekhoda rito hi yi hlengelete ku fikela sweswi.

source: The giant dinosaur of the Triassic.
ts: Ti-dinosaur letikulu ta nkarhi wa Triassic.

source: The giant dinosaurs of the Triassi-.
ts: Ti- dinosaur letikulu ta le Triassi-.

source: The giant dinosaurs of the Triassic.
ts: Ti- dinosaur letikulu ta nkarhi wa Triassic.

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
ts: Ti-dinosaur letikulu ta nkarhi wa Triassic<strong>[read by one voice]</strong>

source: The giant dinosaurs of the Triassic. Yes.
ts: Ti-dinosaur letikulu ta nkarhi wa Triassic. Ina.

source: The giant dino <strong>[cough]</strong> the Triassic.
ts: Xihontlovila xa dino <strong>[cough]</strong> xa Triassic.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
ts: Xikongomelo xa dataset ya Common Voice i ku endla leswaku un’wana na un’wana emisaveni a kota ku aka ku tiva ka mbulavulo, ku tiva swivulavuri, kumbe muxaka wun’wana na wun’wana wa xitirhisiwa lexi lavaka datha ya rito. Mupfuni wa rito i yin’wana ntsena ya tinxaka to tala ta switirhisiwa leswi u nga tirhisaka dataset ku swi aka.

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
ts: Vuhundzuluxi bya tindzimi to tala bya dataset ya Common Voice sweswi byi le ku endliweni ka ku hlanganisiwa na ku basisiwa loku seketeriwaka hi vaaki. Loko u lava ku hi pfuna ku tisa Common Voice eka tindzimi letintshwa, famba u languta <sentenceCollectorLink>Xitirhisiwa xo Hlengeleta Swivulwa</sentenceCollectorLink> ku engetela swivulwa leswintshwa eka dataset, na Mozilla <pontoonLink>Pontoon</pontoonLink> ku hundzuluxela webusayiti hi yoxe. Tindzimi letintshwa ti engeteriwa eka Common Voice ku hoxa xandla hi rito loko ku hlengeletiwile 5000 wa swivulwa leswi pfumeleriweke.

source: The number of recordings and which languages you contribute to will be public.
ts: Nhlayo ya swilo leswi rhekhodiweke ni leswaku hi tihi tindzimi leti u hoxaka xandla eka tona leti nga ta va erivaleni.

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
ts: Endlelo leri hi rona vuxokoxoko bya phurofayili ya muhoxa xandla byi fihliwaka eka swiphemu swa vona swa rito leswi nyikeriweke loko swi pakiwile leswaku swi ta kopiwa tanihi xiphemu xa dataset.

source: There are a lot of public organizations that might want to collaborate and already have a lot of texts they can donate as public domain. Reach out to local universities, Governments and open source organizations to talk about the project and ask for their help.
ts: Ku na tinhlengeletano to tala ta mfumo leti nga ha lavaka ku tirhisana naswona se ti na matsalwa yo tala lawa va nga ma nyikelaka tanihi erivaleni. Fikelela tiyunivhesiti ta laha kaya, Mimfumo na minhlangano ya xihlovo lexi pfulekeke ku vulavula hi phurojeke na ku kombela mpfuneto wa vona.

source: There are lots of ways to think about language. For the purposes of speech recognition models, Common Voice suggests focussing on ‘mutual intelligibility’, or ‘can speakers of this language mostly understand one another if they try to?’
ts: Ku ni tindlela to tala to ehleketa hi ririmi. Hi swikongomelo swa timodlele ta lemukiso wa mbulavulo, Common Voice yi ringanyeta ku kongomisa eka ‘ntwisiso wa ku pfumelelana’, kumbe ‘xana vavulavuri va ririmi leri va nga twisisana kahle loko va ringeta?’.

source: The recording was too long.
ts: Ku rhekhodiwa a ku lehe ngopfu.

source: The recording was too quiet.
ts: Ku rhekhodiwa a ku rhulile ngopfu.

source: The recording was too short.
ts: Ku rhekhodiwa a ku ri komile swinene.

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
ts: Ku ta va na ku hambana ka ntumbuluko eka vholumo exikarhi ka vahlayi. Ala ntsena loko vholumo yi ri ehenhla swinene lerova rhekhodo ya vona i tshovekaka, kumbe (hi ntolovelo) loko yi ri ehansi swinene lerova u nga swi koti ku twa leswi vuriwaka handle ko kombetela eka tsalwa leri tsariweke.

source: These languages are currently under community development. <localizationGlossaryLink>Website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink> is needed to launch.
ts: Tindzimi leti sweswi ti le hansi ka nhluvukiso wa miganga. <localizationGlossaryLink>Ku vekiwa ka webusayiti xikaya</localizationGlossaryLink> na <sentenceCollectionGlossaryLink>nhlengeleto wa swivulwa</sentenceCollectionGlossaryLink> swa laveka ku simeka.

source: The selected file is too large
ts: Fayili leyi hlawuriweke i yikulu swinene

source: The Sentence Collector is part of <commonVoiceLink>Common Voice</commonVoiceLink>. It allows contributors to collect and validate sentences created by the community. You can use this tool also to import and clean-up small-to-medium-sized public domain corpus you have found or collected. All sentences need to be Public Domain. Approved sentences are exported every week to the Common Voice repository and are released on the Common Voice website on every new deployment.
ts: Muhlengeleti wa Swivulwa i xiphemu xa <commonVoiceLink>Common Voice</commonVoiceLink>. Yi pfumelela va hoxa xandla ku hlengeleta no tiyisisa swivulwa leswi tumbuluxiweke hi vaaki. U nga tirhisa xitirhisiwa lexi nakambe ku nghenisa na ku basisa khophasi ya domeyini ya mani na mani leyitsongo ku ya eka ya le xikarhi leyi u yi kumeke kumbe ku yi hlengeleta. Swivulwa hinkwaswo swi lava ku va Xiyenge xa ​​Mani na Mani . Swivulwa leswi pfumeleriweke swi rhumeriwa vhiki rin’wana na rin’wana eka vuhlayiselo bya Common Voice naswona swi humesiwa eka webusayiti ya Common Voice eka ku tirhisiwa kun’wana na kun’wana lokuntshwa.

source: The sentence has a grammatical or spelling error.
ts: Xivulwa lexi xi na xihoxo xa ririmi kumbe xa mapeletelo.

source: The sentence has disrespectful or offensive language.
ts: Xivulwa lexi xi na ririmi ro pfumala xichavo kumbe leri khunguvanyisaka.

source: The sentence must be grammatically correct.
ts: Xivulwa xi fanele ku va lexinene hi tlhelo ra ririmi.

source: The sentence must be speakable.
ts: Xivulwa xi fanele ku va lexi vulavuriwaka.

source: The sentence must be spelled correctly.
ts: Xivulwa xi fanele ku peletiwa hi ndlela leyinene.

source: The site is ready to be launched when it reaches 75% completion.
ts: Sayiti yi lulamerile ku sunguriwa loko yi fika eka 75% wa ku hetisisiwa.

source: The site will be back up as soon as possible. For the latest information, please join the <matrixLink>Matrix community chat</matrixLink> or visit <githubLink>GitHub</githubLink> or <discourseLink>our Discourse forums</discourseLink> to submit and monitor site experience issues.
ts: Sayiti yi ta tlhela yi pfuxetiwa hi ku hatlisa hilaha swi nga kotekaka hakona. Ku kuma vuxokoxoko bya sweswinyana, hi kombela u joyina <matrixLink> maganga a Matrix chat</matrixLink> kumbe u endzela <githubLink>GitHub</githubLink> kumbe <discourseLink>tiforamu ta hina ta Discourse</discourseLink> ku rhumela na ku langutisisa timhaka ta ntokoto wa sayiti.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
ts: Khophasi ya TED-LIUM yi endliwile hi mimbulavulo yo yingiseriwa na mihundzuluxelo ya yona leyi kumekaka eka webusayiti ya TED.

source: The website text is translated into that language.
ts: Tsalwa ra webusayiti ri hundzuluxeriwa hi ririmi rero.

source: This is approximately the number of hours required to train a production speech-to-text system.
ts: Leyi i kwalomu ka nhlayo ya tiawara leti lavekaka ku letela endlelo ra vuhumelerisi bya mbulavulo ku ya eka tsalwa.

source: This is a use case driven segment containing data to power spoken digit recognition and yes / no detection.
ts: Lexi i xiphemu lexi fambiwaka hi xiyimo xa matirhiselo lexi nga na rungula ku nyika matimba ya ku lemuka ka tinomboro leti vulavuriwaka na ku kumiwa ka ina / e-e.

source: This is our process for translating and adapting our content for many locales (languages).
ts: Leri i endlelo ra hina ro hundzuluxela na ku cinca swilo swa hina eka tindhawu to tala (tindzimi).

source: This page gives you an overview of all your submitted sentences. You may also delete already submitted sentences if needed, by marking the checkbox next to it and clicking on &quot;Delete selected sentences&quot; at the bottom. Please only remove sentences if absolutely necessary, for example if you noticed after the fact that a sentence is copyright protected.
ts: Tluka leri ri ku nyika nkatsakanyo wa swivulwa swa wena hinkwaswo leswi u swi rhumeleke. U nga ha tlhela u susa swivulwa leswi se swi rhumeriweke loko swi laveka, hi ku fungha bokisi ro kambela leri nga ekusuhi na rona ivi u tikhoma eka &quot;Susa swivulwa leswi hlawuriweke&quot; ehansi. Hi kombela u susa swivulwa ntsena loko swi laveka hi ku helela, xikombiso loko u xiye endzhaku ka mhaka ya leswaku xivulwa xi sirhelelekile hi mfanelo ya vutshila.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
ts: Xiyimiso lexi xi lawula ku vonakala ka huvo ya varhangeri ya wena. Loko u tumbetiwe, nhluvuko wa wena wu ta va wa xihundla. Leswi swi vula leswaku xifaniso xa wena, vito ra mutirhisi na nhluvuko a swi nge humeleli eka bodo ya varhangeri. Xiya leswaku ku pfuxetiwa ka huvo ya varhangeri swi teka ~{ $minutes }min ku tata ku cinca.

source: Three to go!
ts: Tinharhu ku famba!

source: Tigrinya
ts: Xitigrinya

source: Today
ts: Namuntlha

source: Today's Common Voice progress on clips recorded
ts: Common Voice ya namuntlha yi ya emahlweni eka swiphemu leswi rhekhodiweke

source: Today's Common Voice progress on clips validated
ts: Nhluvuko wa namuntlha wa Common Voice eka swiphemu wu tiyisisiwile

source: Today's Progress
ts: Nhluvuko wa Namuntlha

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
ts: Ku endla leswaku xi va rungula ra Common Voice, xiphemu xa rito xi fanele ku tiyisisiwa hi vatirhisi vambirhi lava hambaneke.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
ts: Ku endla leswaku dataset ya Common Voice yi pfuna hinkwako ku kotekaka hi teke xiboho xo pfumelela tsalwa ra xihlovo leri kumekaka ehansi ka layisense ya Creative Commons (CC0) ntsena. Ku tirhisa mpimanyeto wa CC0 swi vula leswaku swa tika swinene ku kuma na ku hlengeleta tsalwa ra xihlovo, kambe swi pfumelela mani na mani ku tirhisa datha ya rito leyi humelelaka handle ka swipimelo swa matirhiselo kumbe mpfumelelo ku suka eka Mozilla. Eku heteleleni, hi lava ku endla leswaku dataset ya tindzimi to tala yi pfuna hi nkwako laha swi kotekaka kona eka un’wana na un’wana, ku katsa na valavisisi, tiyunivhesiti, swibinndzwana, mimfumo, tinhlengeletano ta xikongomelo xa ntshamisano, na lava tsakelaka ku titsakisa.

source: Top Contributors
ts: Vahoxaxandla va le Henhla

source: Total
ts: Hinkwaswo

source: Total Approved
ts: Nhlayo hinkwayo leyi pfumeleriweke

source: { $totalHours } hours is achievable in just over { $periodMonths } months if { $people } people record { $clipsPerDay } clips a day.
ts: { $totalHours } tiawara ti fikeleleka hi ku tlulanyana { $periodMonths } tin’hweti loko { $people } ti rhekhodo ta vanhu { $clipsPerDay } swiphemu hi siku.

source: { $totalInReview } sentences in review.
ts: { $totalInReview } swivulwa leswi nga eku pfuxeteni.

source: { $totalSentences } total sentences.
ts: { $totalSentence } swivulwa hinkwaswo.

source: To the right we outline the benefits and clarify what information we make public. Use the links below to get started with a Common Voice account on your own device.
ts: Eka tlhelo ra xinene hi boxa mimpfuno ni ku hlamusela leswaku hi rihi rungula leri hi ri endlaka erivaleni. Tirhisa swihlanganisi leswi nga laha hansi ku sungula hi akhawunti ya Common Voice eka xitirhisiwa xa wena.

source: Toward next goal
ts: Ku ya eka pakani leyi landzelaka

source: Track progress here and on your stats page.
ts: Landzelela nhluvuko laha na le ka tluka ra wena ra tinhlayohlayo.

source: Translate this page
ts: Hundzuluxela tluka leri

source: <translateVideoLink>Watch our guide on how to use Pontoon.</translateVideoLink>
ts: <translateVideoLink>Languta nkongomiso wa hina wa ndlela yo tirhisa Pontoon.</translateVideoLink>

source: Translating the site
ts: Ku hundzuluxela sayiti

source: Translation is from English, but you can see <strong>Suggestions</strong> in other languages. Click the <strong>Profile</strong> icon, then <strong>Settings</strong> link and add any languages you speak. At the bottom right-hand corner will be a list of translations called <strong>Locales</strong>. Translations show on the site after one day.
ts: Vuhundzuluxi byi huma eka Xinghezi, kambe u nga vona <strong>Switsundzuxo</strong> hi tindzimi tin'wana. Tsindziyela eka xifaniso xa <strong>Phurofayili</strong>, kutani u hlanganisa <strong>Swiyimiso</strong> ivi u engetela tindzimi tihi na tihi leti u ti vulavulaka. Ekhonweni ya le hansi ya voko ra xinene ku ta va ni nxaxamelo wa vuhundzuluxeri lebyi vuriwaka <strong>tindhawu ta le makaya</strong>. Vuhundzuluxeri byi kombisa eka sayiti endzhaku ka siku rin’we.

source: Translation of the Common Voice site happens on <strong>Pontoon</strong>.
ts: Vuhundzuluxi bya sayiti ya Common voice byi humelela eka <strong>Pontoon</strong>.

source: Tshivenda
ts: Xivenda

source: Turkish
ts: Xiturkey

source: Typically megabytes
ts: Hi ntolovelo ti-megabyte

source: Ukrainian
ts: Xiukraine

source: Understand contribution criteria
ts: Twisisa swipimelo swa ku hoxa xandla

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
ts: Twisisa leswi u faneleke ku swi languta loko u yingisela swiphemu swa rito naswona pfuneta ku endla leswaku tirhekhodo ta wena ta rito ti fuwa na tona!

source: Unexpected response returned from server
ts: Nhlamulo leyi nga languteriwangiki yi vuyile ku suka eka sevha

source: Unfortunately we can’t have Wikimedia articles yet. So do not copy paste from there.
ts: Khombo ra kona a hi nge swi koti ku va na swihloko swa Wikimedia ku fikela sweswi. Kutani u nga kopi ku suka kwalaho.

source: { $unreviewedSentencesByYou } sentences left for you to review.
ts: { $unreviewedSentencesByYou } swivulwa leswi seleke leswaku u kambisisa.

source: Updating…
ts: Ku pfuxetiwa ka...

source: Upload aborted. Do you want to delete your recordings?
ts: Ku Hoxa ku herisiwile. Xana u lava ku susa swilo leswi u swi rhekhodiweke?

source: Upload an image file
ts: Layicha fayili ya xifaniso

source: Urdu
ts: Xiurdu

source: User Name
ts: Vito ra Mutirhisi

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
ts: Vatirhisi va tiyisekisa ku pakanisa ka swiphemu leswi nyikeriweke, va kambela leswaku xivulavuri xi hlaye xivulwa hi ndlela leyinene.

source: Using Common Voice
ts: Ku Tirhisa Common Voice

source: Uyghur
ts: Xi-Uyghur

source: Uzbek
ts: Xiuzbek

source: Validated Clips
ts: Swiphemu leswi Tiyisisiweke

source: Validated Hours
ts: Tiawara leti Tiyisisiweke

source: Validated Hr. Total
ts: Ku tiyisisiwile Hr. Hinkwaswo

source: { $validatedSentences } validated sentences.
ts: { $validatedSentences } swivulwa hinkwaswo.

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
ts: Ku tiyisisa swiphemu leswi nyikeriweke i swa nkoka hi ndlela leyi fanaka eka vurhumiwa bya Common Voice. Yingisela u hi pfuna ku tumbuluxa datha ya rito ya xihlovo lexi pfulekeke xa ku xixima.

source: Validation Progress
ts: Nhluvuko wa ku Tiyisisa

source: Validations
ts: Switiyisiso

source: Value and recognition.
ts: Nkoka ni ku xiximiwa.

source: Variants are a specific form of a language - for example shared by those living in a geography or commmunity. Sometimes these are called dialects.
ts: Swihlawuhlawu i xivumbeko xo karhi xa ririmi - xikombiso lexi avelaniwa hi lava tshamaka eka ntivo-misava kumbe muganga. Minkarhi yin’wana leswi swi vuriwa tindzimi ta ririmi.

source: Varying Pronunciations
ts: Ku Hambana-hambana ka Mavitanelo

source: Venetian
ts: Xivenetia

source: Version
ts: Nkandziyiso

source: Vietnamese
ts: Xivietnam

source: View your progress against personal and project goals.
ts: Languta nhluvuko wa wena ku ya hi tipakani ta munhu hi xiyexe ni ta phurojeke.

source: Visible
ts: Swi vonaka

source: Voice clips are entered into a submission queue that readies them for listening.
ts: Swiphemu swa rito swi nghenisiwa eka layini yo rhumela leyi swi lunghiselelaka ku yingisela.

source: Voice Contribution
ts: Ku Hoxa xandla ka Rito

source: Voice Dataset, Ready for Download
ts: Dataset ya Rito, Yi Lunghekele ku Dawuniloda

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
ts: "Rito i ra ntumbuluko, rito i ra munhu. Hi yona mhaka leyi hi tsakisiwaka hi ku tumbuluxa rito leri tirhisiwaka theknoloji ya michini ya hina. Kambe ku tumbuluxa tisisiteme ta rito, nhlayo leyikulu swinene ya rito datha ya laveka."

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
ts: Rito i ra ntumbuluko, rito i ra munhu. Hi yona mhaka leyi hi nyanyulaka hi ku tumbuluxa rito leri tirhisiwaka thekinoloji ya michini ya hina. Kambe ku tumbuluxa tisisiteme ta rito, nhlayo leyikulu swinene ya rito data ya laveka.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language.
ts: Theknoloji yo tiva rito yi hundzula ndlela leyi hi tirhisanaka hi yona ni michini, kambe tisisiteme leti nga kona sweswi ta ku durha naswona ti ni vulawuri. Common Voice i xiphemu xa kungu ra Mozilla ro endla leswaku theknoloji yo tiva rito yi antswa no fikeleleka eka un’wana na un’wana. Common Voice i dathabeyisil eyikulu ya misava hinkwayo ya marito lama nyikeriweke leyi pfumelelaka un’wana na un’wana ku letela ti-app leti tirhisaka rito hi ririmi rin’wana na rin’wana leri nga kotekaka hi xihatla no ku olova.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Mozilla Common Voice is an initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language. We're not only collecting voice samples in widely spoken languages but also in those with a smaller population of speakers. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and communities to address this gap themselves.
ts: Theknoloji yo tiva rito yi le ku hundzuleni ka ndlela leyi hi tirhisanaka na michini, kambe tisisiteme leti nga kona sweswi ta durha naswona ti na vulawuri. Mozilla Common Voice i kungu ro endla leswaku theknoloji yo tiva rito yi antswa no fikelela vanhu van'wana na van'wana. Common Voice i dathabeyisi leyikulu leyi nga kona emisaveni hinkwayo ya lava nga nyikela hi marito lama pfumelelaka un’wana ni un’wana ku letela ti-app leti tirhisaka rito hi ririmi leri nga ha vaka ri ri kona hi ku hatlisa ni ku olova. A hi hlengeleti swikombiso swa rito hi tindzimi leti vulavuriwaka ngopfu ntsena kambe na le ka leti nga na nhlayo yitsongo ya vavulavuri. Ku kandziyisa dataset yo hambana ya marito swi ta nyika matimba eka vatumbuluxi, van'wamabindzu, na miganga ku lulamisa xivandla lexi hi voxe.

source: Voices Online Now
ts: Marito Ya Le Ka Inthanete Sweswi

source: Voice Validation
ts: Ntiyisiso wa Rito

source: Volume
ts: Vholumu

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
ts: VoxForge yi simekiwile ku hlengeleta mbulavulo lowu tsariweke ku tirhisiwa na Tinjhini to lemuka mbulavulo wa xihlovo xa mahala na lexi pfulekeke.

source: Want to help make Common Voice even better? Great! Get in touch via email or <discourseLink>Discourse</discourseLink> forums, submit site issues via <githubLink>GitHub</githubLink>, or join the <matrixLink>Matrix</matrixLink> community chat.
ts: Xana u lava ku pfuneta ku endla leswaku Common Voice yi antswa swinene? Swikahle! Tihlanganisi hi ku tirhisa imeyili kumbe <discourseLink>Discourse</discourseLink> tiforamu, rhumela timhaka ta sayiti hi ku tirhisa <githubLink>GitHub</githubLink>, kumbe u joyina <matrixLink>Matrix</matrixLink> ku burisana ka vaaki.

source: Want to stay in touch with Common Voice?
ts: Xana u lava ku tshama u ri eku hlanganiseni na Common Voice?

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
ts: Xana u lava ku pfuxetiwa loko hi humesa vuhundzuluxeri lebyintshwa bya rungula ra Common Voice? Tsarisa eka phephahungu ra hina.

source: Watch our video explainer to help
ts: Languta xihlamusela-marito xa hina xa vhidiyo leswaku u pfuna
